"1.JavaScript诞生的目的: 处理输入验证操作"
"javascript具备了与浏览器窗口及其内容等几乎所有方面的交互，拥有了闭包，匿名函数，元编程等特性"
"JavaScript由三部分组成：核心(ECMAScript)，文档对象模型(DOM),浏览器对象模型(BOM)"
"ECMAScript的组成部分：语法，类型，关键字，语句，保留子，，操作符，对象"
"文档模型对象是针对XML但经过用于HTML的应用编程接口。DOM把整个页面映射为一个多层节点，html或XML页面的每个组成部分都是某种类型的节点。"
"通过DOM创建的文档树型图,开发人员获得了控制页面内容和结构的控制权，通过DOM的api，可以删除，添加，修改或替换节点"
"浏览器对象:控制浏览器页面显示以外的部分，提供有浏览器交互的部分"



"在HTML使用JavaScript：在html中使用js，主要通过<script>进行插入或者引入"
"script定义了六个属性：1. async：可选，立即下载脚本，不影响页面的其他操作，对外部脚本文件有效"
    "2. charset：可选，表示src属性指定的代码的字符集"
    "3. defer表示脚本延迟到文档完全解析和显示之后执行，只对外部脚本有效"
    "4. src 可选包含执行代码的外部文件"
    "type： 必选 表示编写代码的脚本语言"
""
  